In [50]:
import pandas as pd
from sqlalchemy import create_engine

In [51]:
life_expectancy_file="life_expectancy.csv"
country_profile_file="country_profile_variables.csv"

In [52]:
life_expectancy_df= pd.read_csv(life_expectancy_file)
country_profile_df = pd.read_csv(country_profile_file)

In [54]:
life_expectancy_df= life_expectancy_df.dropna(how='any')
cleaned_life_expectancy_df= life_expectancy_df[['country', '2010','2011', '2012', '2013', '2014', '2015', '2016']]
cleaned_life_expectancy_df=cleaned_life_expectancy_df.set_index('country')
cleaned_life_expectancy_df=cleaned_life_expectancy_df.rename(columns={'2010': 'year_2010', '2011': 'year_2011', '2012': 'year_2012', '2013': 'year_2013', '2014': 'year_2014', '2015': 'year_2015', '2016': 'year_2016'})
cleaned_life_expectancy_df.head()

,year_2010,year_2011,year_2012,year_2013,year_2014,year_2015,year_2016
country,,,,,,,
Afghanistan,53.6,54.0,54.4,54.8,54.9,53.8,52.72
Albania,77.2,77.4,77.5,77.7,77.9,78.0,78.10
Algeria,76.0,76.1,76.2,76.3,76.3,76.4,76.50
Angola,57.6,58.1,58.5,58.8,59.2,59.6,60.00
Antigua and Barbuda,75.8,75.9,76.1,76.2,76.3,76.4,76.50

In [55]:
country_profile_df = country_profile_df.dropna(how='any')
cleaned_country_profile_df = country_profile_df[['country', 'Population in thousands (2017)', 'Surface area (km2)']]
cleaned_country_profile_df=cleaned_country_profile_df.set_index('country')
cleaned_country_profile_df=cleaned_country_profile_df.rename(columns={'Population in thousands (2017)': 'population', 'Surface area (km2)':'surface_area'})

In [56]:
import config

rds_connection_string = f"postgres:{config.password}@localhost:5432/countries_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [57]:
engine.table_names()

['population', 'expectancy']

In [58]:
cleaned_life_expectancy_df.to_sql(name='expectancy', con=engine, if_exists='append', index=True)
cleaned_country_profile_df.to_sql(name='population', con=engine, if_exists='append', index=True)

In [62]:
pd.read_sql_query('select * from expectancy', con=engine).head()

,country,year_2010,year_2011,year_2012,year_2013,year_2014,year_2015,year_2016
0,Afghanistan,54,54,54,55,55,54,53
1,Albania,77,77,78,78,78,78,78
2,Algeria,76,76,76,76,76,76,77
3,Angola,58,58,59,59,59,60,60
4,Antigua and Barbuda,76,76,76,76,76,76,77

In [63]:
pd.read_sql_query('select * from population', con=engine).head()

          country  population  surface_area
0     Afghanistan       35530        652864
1         Albania        2930         28748
2         Algeria       41318       2381741
3  American Samoa          56           199
4         Andorra          77           468